<?php

include 'functions.php';

$nd = single_curl($_GET['link']);
$nd = preg_replace_callback('/<em class="n_(\d+)"><\/em>/', 'scananh', $nd);
$nd = preg_replace('/<center class="chapterPages">.+?<\/center>/', '', $nd);
$nd = preg_replace('/<font color="blue">.+?<\/font>/', '', $nd);
$nd = preg_replace_callback('/<em class=n_(\d+)><\/em>/', 'scananh', $nd);
$nd = str_replace('&nbsp;', '', $nd);

$nd = str_replace(". ", ".\n\n", wp_strip_all_tags($nd, true));

header("Content-Type: text/plain");
echo normalize($nd);
echo "\n\n";

function scananh ($match)
{
	$str = '男人啊爱按暴臀逼擦潮操插吃抽处床春唇刺粗大洞逗硬儿反犯峰妇抚夫腹干搞根公宫勾股狠花滑坏魂鸡激夹奸交叫娇姐禁精进紧菊渴口裤胯快浪力接乱裸妈毛迷靡妹摸嫩母娘尿咛女哦趴喷婆屁气枪窃骑妻情亲裙热日肉揉乳软润入塞骚色上舌射身深湿兽受舒爽水睡酥死烫痛舔天体挺头腿脱味慰吻握喔污下小性胸血穴阳痒药腰夜液野衣姨吟淫荫幽诱尤欲吁玉吮窄占征汁嘴,.*慾丢弄';

	//print_r(preg_split('//u', $str, null, PREG_SPLIT_NO_EMPTY));

	$chus = preg_split('//u', $str, null, PREG_SPLIT_NO_EMPTY);

	$chus[164] = '...';

	return $chus[($match[1]-1)];
}

function normalize($text = '')
{
	$arr = [
		'《' => '⟨',
		'》' => '⟩',
		'　' => ' ',
		'ˉ' => '¯',
		'‥' => '¨',
		'‧' => '·',
		'•' => '·',
		'‵' => '`',
		'｀' => '`',
		'。' => '.',
		'﹒' => '.',
		'．' => '.',
		'﹐' => ',',
		'，' => ',',
		'﹑' => ',',
		'、' => ',',
		'︰' => ':',
		'∶' => ':',
		'﹔' => ';',
		'；' => ';',
		'﹕' => ':',
		'：' => ':',
		'﹖' => '?',
		'？' => '?',
		'﹗' => '!',
		'！' => '!',
		'﹙' => '(',
		'（' => '(',
		'﹚' => ')',
		'）' => ')',
		'﹛' => '{',
		'｛' => '{',
		'﹜' => '}',
		'｝' => '}',
		'【' => '[',
		'﹝' => '[',
		'［' => '[',
		'】' => ']',
		'﹞' => ']',
		'］' => ']',
		'＾' => '^',
		'﹟' => '#',
		'＃' => '#',
		'﹠' => '&',
		'＆' => '&',
		'﹡' => '*',
		'＊' => '*',
		'﹢' => '+',
		'＋' => '+',
		'﹣' => '-',
		'－' => '-',
		'﹤' => '<',
		'＜' => '<',
		'﹥' => '>',
		'＞' => '>',
		'﹦' => '=',
		'＝' => '=',
		'﹩' => '$',
		'＄' => '$',
		'﹪' => '%',
		'％' => '%',
		'﹫' => '@',
		'＠' => '@',
		'≒' => '≈',
		'≦' => '≤',
		'≧' => '≥',
		'︱' => '|',
		'｜' => '|',
		'︳' => '|',
		'︿' => '∧',
		'﹀' => '∨',
		'／' => '/',
		'＼' => '\\',
		'╴' => '_',
		'＿' => '_',
		'「' => '“',
		'」' => '”',
		'『' => '‘',
		'』' => '’',
		'＂' => '"',
		'～' => '~',
		'｟' => '(',
		'｠' => ')',
		'ａ' => 'a',
		'ｂ' => 'b',
		'ｃ' => 'c',
		'ｄ' => 'd',
		'ｅ' => 'e',
		'ｆ' => 'f',
		'ｇ' => 'g',
		'ｈ' => 'h',
		'ｉ' => 'i',
		'ｊ' => 'j',
		'ｋ' => 'k',
		'ｌ' => 'l',
		'ｍ' => 'm',
		'ｎ' => 'n',
		'ｏ' => 'o',
		'ｐ' => 'p',
		'ｑ' => 'q',
		'ｒ' => 'r',
		'ｓ' => 's',
		'ｔ' => 't',
		'ｕ' => 'u',
		'ｖ' => 'v',
		'ｗ' => 'w',
		'ｘ' => 'x',
		'ｙ' => 'y',
		'ｚ' => 'z',
		'Ａ' => 'A',
		'Ｂ' => 'B',
		'Ｃ' => 'C',
		'Ｄ' => 'D',
		'Ｅ' => 'E',
		'Ｆ' => 'F',
		'Ｇ' => 'G',
		'Ｈ' => 'H',
		'Ｉ' => 'I',
		'Ｊ' => 'J',
		'Ｋ' => 'K',
		'Ｌ' => 'L',
		'Ｍ' => 'M',
		'Ｎ' => 'N',
		'Ｏ' => 'O',
		'Ｐ' => 'P',
		'Ｑ' => 'Q',
		'Ｒ' => 'R',
		'Ｓ' => 'S',
		'Ｔ' => 'T',
		'Ｕ' => 'U',
		'Ｖ' => 'V',
		'Ｗ' => 'W',
		'Ｘ' => 'X',
		'Ｙ' => 'Y',
		'Ｚ' => 'Z',
		'１' => '1',
		'２' => '2',
		'３' => '3',
		'４' => '4',
		'５' => '5',
		'６' => '6',
		'７' => '7',
		'８' => '8',
		'９' => '9',
		'０' => '0',
	];

	foreach ($arr as $key => $value) {
		$text = str_replace($key, $value, $text);
	}

	return $text;

}